app/Http/Controllers/Auth/RegisteredUserController.php

select `name`, `id` from `districts`
---
    public function create()
    {
        $districts = District::pluck('name', 'id')->toArray();

insert into `users` (`role_id`, `district_id`, `name`, `email`, `password`, `updated_at`, `created_at`) values (3, '', 'tonmoy', 'rhtonmoyhd@gmail.com', '$2y$10$15cX31V33C.4FaojLBDL9.iqYE7TKnpMwk1c3SsuhkKAZ3EDVPk8a', '2022-10-25 20:30:53', '2022-10-25 20:30:53')
insert into `profiles` (`present_address`, `user_id`, `updated_at`, `created_at`) values ('dhaka', 1, '2022-10-25 20:30:53', '2022-10-25 20:30:53')
---
    public function store(Request $request)
    {
        try{
            $request->validate([
                'name' => ['required', 'string', 'max:255'],
                'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
                'password' => ['required', 'confirmed', Rules\Password::defaults()],
            ]);

            DB::beginTransaction();
            $user = User::create([
                'role_id' => 3,
                'district_id' => $request->district_id,
                'name' => $request->name,
                'email' => $request->email,
                'password' => Hash::make($request->password),
            ]);

            $user->profile()->create([
                'present_address' => $request->present_address
            ]);