app/View/Composers/FrontendComposer.php

    public function compose(View $view)
    {
        $categories = Category::all();
---
select * from `categories` where `categories`.`deleted_at` is null