app/Http/Controllers/CarouselController.php

select * from `carousels` where `carousels`.`deleted_at` is null
---
    public function index()
    {
        $carousels = Carousel::all();