app/Http/Controllers/CategoryController.php

    public function index()
    {
        $categories = Category::all();
---
select * from `categories` where `categories`.`deleted_at` is null