app/Http/Controllers/ColorController.php

    public function index()
    {
        $colors = Color::all();
---
select * from `colors` where `colors`.`deleted_at` is null