app/Http/Controllers/ProductController.php

select count(*) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function index()
    {
        $paginatePerPage = 20;
        $serialNo = 1;
        if($pageNumber = request('page')){
            $serialNo = $paginatePerPage * ($pageNumber-1) + 1;
        }

        $products = Product::with('category')->latest()->paginate($paginatePerPage);