app/Http/Controllers/UserController.php

select * from `profiles` where `profiles`.`user_id` in (1)
select * from `roles` where `roles`.`id` in (3)
select * from `users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::with(['profile', 'role'])->latest()->paginate(10);