app/Http/Controllers/WelcomeController.php

    public function welcome()
    {
        if($keyword = request('keyword')){
            $products = Product::latest()
                                ->where('title', 'LIKE', "%{$keyword}%")
                                ->paginate(15);
        }else{
            $products = Product::latest()->paginate(15);
        }

        $carousels = Carousel::latest()->get();
---
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select * from `carousels` where `carousels`.`deleted_at` is null order by `created_at` desc